#!/usr/bin/python3
# coding: utf-8
##################################################################
# 5. 数组分割
# split 将一个数组分割为多个子数组; hsplit 将一个数组水平分割为多个子数组 (按列); vsplit 将一个数组竖直分割为多个子数组 (按行)
##################################################################
# numpy.split(ary, indices_or_sections, axis=0); 该函数沿特定的轴将数组分割为子数组
# ary: 被分割的输入数组; axis: 默认为 0
# indices_or_sections: 可以是整数, 表明要从输入数组创建的, 等大小的子数组的数量; 如果此参数是一维数组, 则其元素表明要创建新子数组的点
import numpy as np
a = np.arange(9); print(a)  # [0 1 2 3 4 5 6 7 8]
b = np.split(a, 3); print(b)  # [array([0, 1, 2]), array([3, 4, 5]), array([6, 7, 8])]; 将数组分为三个大小相等的子数组
b = np.split(a, [4, 7]); print(b)  # [array([0, 1, 2, 3]), array([4, 5, 6]), array([7, 8])]; 将数组在一维数组中表明的位置分割
##################################################################
# numpy.hsplit(水平分割); split() 函数的特例, 其中轴为 1 表示水平分割, 无论输入数组的维度是什么
a = np.arange(16).reshape(4, 4); print(a)  # [[ 0 1 2 3] [ 4 5 6 7] [ 8 9 10 11] [12 13 14 15]]
b = np.hsplit(a, 2); print(b)  # [array([[ 0,  1], [ 4,  5], [ 8,  9], [12, 13]]), array([[ 2,  3], [ 6,  7], [10, 11], [14, 15]])]
##################################################################
# numpy.vsplit(竖直分割); split() 函数的特例, 其中轴为 0 表示竖直分割, 无论输入数组的维度是什么
a = np.arange(16).reshape(4, 4); print(a)  # [[ 0 1 2 3] [ 4 5 6 7] [ 8 9 10 11] [12 13 14 15]]
b = np.vsplit(a, 2); print(b)  # [array([[0, 1, 2, 3], [4, 5, 6, 7]]), array([[ 8,  9, 10, 11], [12, 13, 14, 15]])]
