#!/usr/bin/python3
# coding: utf-8
import numpy as np
##################################################################
## meshgrid 在二维平面中将每一个 x 和每一个 y 分别对应起来, 编织成栅格
x = np.linspace(1, 3, 3); print(x)
y = np.linspace(4, 6, 3); print(y)
X, Y = np.meshgrid(x, y); print(X, '\n', Y)
# [[ 1.  2.  3.]
#  [ 1.  2.  3.]
#  [ 1.  2.  3.]]
#  [[ 4.  4.  4.]
#  [ 5.  5.  5.]
#  [ 6.  6.  6.]]
##################################################################
## 含义:
# 1. meshgrid() 的含义是将二维的 (x, y) 为 三维的 (x, y, z) 做准备; 对于每一个 (x, y) 都存在一个 z...
# 2. 矩阵 X 的行向量是向量 x 的简单复制, 而矩阵 Y 的列向量是向量 y 的简单复制
# 3. 生成 size(b) x size(a) 大小的矩阵 A 和 B, 它相当于 a 从一行重复增加到 size(b) 行, 把 b 转置成一列再重复增加到 size(a) 列
# 4. 因此命令等效于:
#    A = ones(size(b)) * a
#    B = b' * ones(size(a))
##################################################################
##
print(X**2, '\n', X * X)  # 结果一样
R = np.sqrt(X**2 + Y**2); print(R)
