#!/usr/bin/python3
# coding: utf-8
import numpy as np
##################################################################
## slice 切片索引
a = np.array([[1, 2, 3], [4, 5, 6]])
print(a, '\n', a[:2], '\n', a[:2, :1])  # 可以用 a[:2, :1], 第一个参数针对行, 第二个参数是列
b = [[1, 2, 3,], [4, 5, 6]]
print(b, '\n', b[:2])
# print(b[:2, :])  # 这里会报错
##################################################################
## np.newaxis 可以将向量添加维度, 转化为列矩阵或行矩阵
a = np.linspace(-1, 1, 4)  # [-1.         -0.33333333  0.33333333  1.        ]
print(a, '\n', a[:], '\n', a[:, np.newaxis], '\n', a[np.newaxis, :])  # 将行向量分开
print(a.shape, a[:, np.newaxis].shape, a[np.newaxis, :].shape)  # (4,) (4, 1) (1, 4)
# [[-1.        ] [-0.33333333] [ 0.33333333] [ 1.        ]]
##################################################################
## 矩阵和常量相加/乘
x = np.arange(1, 10); y = 3 * x + 100; print(y)  # numpy 支持, 而 range 不支持
# x = range(1, 10); y = 3 * x; print(y)  # unsupported operand type(s) for *: 'int' and 'range'
##################################################################
## 总结:
# 1. numpy 对象可以用 [:2, :1] 这样来截取矩阵的行和列这样的子矩阵, list 只能截取行
# 2. (4,) 表示向量, (4, 1) (1, 4) 表示矩阵
