#!/usr/bin/python3
# coding: utf-8
##################################################################
## str -> tuple
print(tuple(eval("(1, 2, 3)")))  # (1, 2, 3)
##################################################################
## str -> list
print(list(eval("(1, 2, 3)")))  # [1, 2, 3]
##################################################################
## str -> dict
print(eval("{'name': 'jrp', 'age': 24}"))  # {'name': 'jrp', 'age': 24}
# 可以不用 dict 强制转型
# json.loads() 的 key value 必须是 "" 包围的...
